# Challenge 1 - Design the Database
Using pen and paper (or computer software if you are skillful at creating digital diagrams), design a database to meet the minimal requirements of your boss. The minimal information to be recorded is described below:

Cars - e.g. the vehicle identification number (VIN), manufacturer, model, year, and color of the cars in your company's inventory.

Customers - e.g. the customer ID, name, phone number, email, address, city, state/province, country, and zip/postal code of the customers.

Salespersons - e.g. staff ID, name, and the store at your company.

Invoices - e.g. the invoice number, date, car, customer, and salesperson related to each car sale.

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///CARS.db

In [4]:
%%sql

CREATE TABLE Cars (VIN VARCHAR (20), Make CHAR(10), Model VARCHAR(15), Year TINYINT (4), Colour VARCHAR (7));

 * sqlite:///CARS.db
Done.

[]

In [6]:
%%sql

CREATE TABLE Customers (Customer ID CHAR(6), Name VARCHAR(30), PhoneNo VARCHAR(15), Email VARCHAR (20), Address VARCHAR (40), City CHAR(10), State VARCHAR(20), Country CHAR(6), Zipcode VARCHAR (10));

 * sqlite:///CARS.db
Done.

[]

In [7]:
%%sql

CREATE TABLE Salespersons (Staff ID CHAR(5), Name CHAR(30), Store CountryCHAR(20));

 * sqlite:///CARS.db
Done.

[]

In [12]:
%%sql
CREATE TABLE Invoices (Invoice CHAR(9),Date DATETIME, Car ID CHAR(1), Customer ID CHAR(1), Salesperson CHAR(30));

 * sqlite:///CARS.db
Done.

[]

In [31]:
%%sql
SELECT name FROM sqlite_master
WHERE type = 'table'
ORDER BY name;

 * sqlite:///CARS.db
Done.

[('Cars',), ('Customers',), ('Invoices',), ('Salespersons',)]

In [40]:
%%sql

INSERT INTO Cars VALUES('3K096I98581DHSNUP','Volkswagen','Tiguan', '2019', 'Blue'), ('ZM8G7BEUQZ97IH46V','Peugeot', 'Rifter','2019','Red'), ('RKXVNNIHLVVZOUB4M','Ford','Fusion','2018','White'),('HKNDGS7CU31E9Z7JW', 'Toyota','RAV4','2018','Silver'),('DAM41UDN3CHU2WVF6','Volvo','V60','2019','Gray'), ('DAM41UDN3CHU2WVF6','Volvo','V60 Cross Country', '2019','Gray')

 * sqlite:///CARS.db
6 rows affected.

[]

In [44]:
%%sql

INSERT INTO Customers VALUES ('10001','Pablo Picasso','+34636176382','n/a', 'Paseo de la Chopera 14', 'Madrid','Madrid','Spain','28045'), ('20001','Abraham Lincoln','+13059077086','n/a','120 SW 8th St', 'Miami','Florida', 'United States','33130'),('30001', 'Napoléon Bonaparte','+33179754000','n/a','40 Rue du Colisée','Paris','Île-de-France','France','75008')

 * sqlite:///CARS.db
3 rows affected.

[]

In [46]:
%%sql

INSERT INTO Salespersons VALUES ('00001','Petey Cruiser','Madrid'),('00002','Anna Sthesia','Barcelona'),('00003','Paul Molive','Berlin'), ('00004','Gail Forcewind','Paris'), ('00005','Paige Turner', 'Mimia'), ('00006', 'Bob Frapples','Mexico City'), ('00007','Walter Melon','Amsterdam'), ('00008','Shonda Leer','São Paulo')

 * sqlite:///CARS.db
8 rows affected.

[]

In [47]:
%%sql

INSERT INTO Invoices VALUES ('852399038', '22-08-2018', '0','1','3'), ('731166526', '31-12-2018', '3', '0', '5'), ('271135104', '22-01-2019', '2','2','7')

 * sqlite:///CARS.db
3 rows affected.

[]

In [48]:
%sql SELECT * FROM cars limit 10;

 * sqlite:///CARS.db
Done.

[('3K096I98581DHSNUP', 'Volkswagen', 'Tiguan', 2019, 'Blue'),
 ('3K096I98581DHSNUP', 'Volkswagen', 'Tiguan', 2019, 'Blue'),
 ('ZM8G7BEUQZ97IH46V', 'Peugeot', 'Rifter', 2019, 'Red'),
 ('RKXVNNIHLVVZOUB4M', 'Ford', 'Fusion', 2018, 'White'),
 ('HKNDGS7CU31E9Z7JW', 'Toyota', 'RAV4', 2018, 'Silver'),
 ('DAM41UDN3CHU2WVF6', 'Volvo', 'V60', 2019, 'Gray'),
 ('DAM41UDN3CHU2WVF6', 'Volvo', 'V60 Cross Country', 2019, 'Gray')]

In [49]:
%sql SELECT * FROM Customers limit 10;

 * sqlite:///CARS.db
Done.

[('10001', 'Pablo Picasso', '+34636176382', 'n/a', 'Paseo de la Chopera 14', 'Madrid', 'Madrid', 'Spain', '28045'),
 ('20001', 'Abraham Lincoln', '+13059077086', 'n/a', '120 SW 8th St', 'Miami', 'Florida', 'United States', '33130'),
 ('30001', 'Napoléon Bonaparte', '+33179754000', 'n/a', '40 Rue du Colisée', 'Paris', 'Île-de-France', 'France', '75008')]

In [50]:
%sql SELECT * FROM Salespersons limit 10;

 * sqlite:///CARS.db
Done.

[('00001', 'Petey Cruiser', 'Madrid'),
 ('00002', 'Anna Sthesia', 'Barcelona'),
 ('00003', 'Paul Molive', 'Berlin'),
 ('00004', 'Gail Forcewind', 'Paris'),
 ('00005', 'Paige Turner', 'Mimia'),
 ('00006', 'Bob Frapples', 'Mexico City'),
 ('00007', 'Walter Melon', 'Amsterdam'),
 ('00008', 'Shonda Leer', 'São Paulo')]

In [51]:
%sql SELECT * FROM Invoices limit 10;

 * sqlite:///CARS.db
Done.

[('852399038', '22-08-2018', '0', '1', '3'),
 ('731166526', '31-12-2018', '3', '0', '5'),
 ('271135104', '22-01-2019', '2', '2', '7')]